Revit 2027 API
RebarTerminationOrientation Enumeration
 Orientation of a rebar termination (e.g hook, crank) relative to the path of the Rebar Shape.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public enum RebarTerminationOrientation
Public Enumeration RebarTerminationOrientation
public enum class RebarTerminationOrientation
type RebarTerminationOrientation
Members
Member name | Value | Description
Left | 1 |  Hook or crank towards the left of a segment-based shape (RebarShapeDefinitionBySegments), or to the interior of an arc-based shape (RebarShapeDefinitionByArc).
Right | -1 |  Hook or crank towards the right of a segment-based shape (RebarShapeDefinitionBySegments), or to the exterior of an arc-based shape (RebarShapeDefinitionByArc).
See Also
Reference
Autodesk.Revit.DB.Structure Namespace